log/2015-03-18-13.38.13.log

Execute Anonymous

================================

MetadataService.MetadataPort service = MetadataUtils.createService();

List<String> layoutNames = new List<String>{
	MetadataUtils.addNamespaceToCustomObjectLayout('TeamRaiser_Registration__c-TeamRaiser Registration Layout')
};

List<MetadataService.Layout>requestedLayouts = (List<MetadataService.Layout>) service.readMetadata('Layout', layoutNames).getRecords();

System.debug(requestedLayouts[0]);

================================

31.0 APEX_CODE,DEBUG;APEX_PROFILING,DEBUG;CALLOUT,INFO;DB,INFO;VALIDATION,INFO;WORKFLOW,INFO
Execute Anonymous: MetadataService.MetadataPort service = MetadataUtils.createService();
Execute Anonymous: 
Execute Anonymous: List<String> layoutNames = new List<String>{
Execute Anonymous: 	MetadataUtils.addNamespaceToCustomObjectLayout('TeamRaiser_Registration__c-TeamRaiser Registration Layout')
Execute Anonymous: };
Execute Anonymous: 
Execute Anonymous: List<MetadataService.Layout>requestedLayouts = (List<MetadataService.Layout>) service.readMetadata('Layout', layoutNames).getRecords();
Execute Anonymous: 
Execute Anonymous: System.debug(requestedLayouts[0]);
11:38:12.527 (527793887)|EXECUTION_STARTED
11:38:12.527 (527805296)|CODE_UNIT_STARTED|[EXTERNAL]|execute_anonymous_apex
11:38:12.572 (572338234)|METHOD_ENTRY|[2]|01po0000003Oh7F|MetadataUtils.MetadataUtils()
11:38:12.572 (572414587)|METHOD_EXIT|[2]|MetadataUtils
11:38:12.572 (572450697)|METHOD_ENTRY|[1]|01po0000003Oh7F|MetadataUtils.createService()
11:38:12.577 (577129100)|CONSTRUCTOR_ENTRY|[9]|01po0000003Oh7D|<init>()
11:38:12.577 (577580074)|CONSTRUCTOR_EXIT|[9]|01po0000003Oh7D|<init>()
11:38:12.577 (577612777)|CONSTRUCTOR_ENTRY|[11]|01po0000003Oh7D|<init>()
11:38:12.577 (577709008)|CONSTRUCTOR_EXIT|[11]|01po0000003Oh7D|<init>()
11:38:12.586 (586390824)|METHOD_EXIT|[1]|01po0000003Oh7F|MetadataUtils.createService()
11:38:12.586 (586491213)|METHOD_ENTRY|[3]|01po0000003Oh7F|MetadataUtils.addNamespaceToCustomObjectLayout(String)
11:38:12.605 (605953226)|METHOD_ENTRY|[1]|01po0000000dllI|Utils.Utils()
11:38:12.606 (606760994)|METHOD_EXIT|[1]|Utils
11:38:12.606 (606795143)|METHOD_ENTRY|[600]|01po0000000dllI|Utils.addNamespace(String)
11:38:12.609 (609341547)|METHOD_ENTRY|[1]|01po0000000dlkU|Constants.Constants()
11:38:12.614 (614240108)|METHOD_EXIT|[1]|Constants
11:38:12.614 (614268315)|METHOD_EXIT|[600]|01po0000000dllI|Utils.addNamespace(String)
11:38:12.614 (614290065)|METHOD_ENTRY|[600]|01po0000000dllI|Utils.addNamespace(String)
11:38:12.614 (614305024)|METHOD_EXIT|[600]|01po0000000dllI|Utils.addNamespace(String)
11:38:12.614 (614319017)|METHOD_EXIT|[3]|01po0000003Oh7F|MetadataUtils.addNamespaceToCustomObjectLayout(String)
11:38:12.614 (614415131)|METHOD_ENTRY|[7]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
11:38:12.616 (616467422)|CONSTRUCTOR_ENTRY|[8870]|01po0000003Oh7D|<init>()
11:38:12.616 (616619412)|CONSTRUCTOR_EXIT|[8870]|01po0000003Oh7D|<init>()
11:38:12.622 (622698592)|CALLOUT_REQUEST|[8876]|<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header><SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata"><sessionId>00Do0000000HyRH!AQYAQN8haRiIUPIy8IqJdQuuONXpAnNLoOdGuf7fuC3RKyMySkJ3eqSwsblo8.B5_Fi3Y0VDRwn5grPbtgdnJOZulbPGd23U</sessionId></SessionHeader></env:Header><env:Body><readMetadata xmlns="http://soap.sforce.com/2006/04/metadata"><type>Layout</type><fullNames>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullNames></readMetadata></env:Body></env:Envelope>
11:38:12.622 (622757984)|CALLOUT_REQUEST|[8876]|readMetadata_element:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), field_order_type_info=(type_x, fullNames), fullNames=(TeamRaiser_Registration__c-TeamRaiser Registration Layout), fullNames_type_info=(fullNames, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), type_x=Layout, type_x_type_info=(type, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false)]::SFDC_STACK_DEPTH=1 SOAPAction="" User-Agent=SFDC-Callout/33.0 Accept=text/xml Content-Type=text/xml; charset=UTF-8 
11:38:12.766 (766388754)|CALLOUT_RESPONSE|[8876]|<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><readMetadataResponse><result><records xsi:type="Layout"><fullName>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullName><excludeButtons>Submit</excludeButtons><layoutSections><customLabel>true</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>TeamRaiser Progress</label><layoutColumns><layoutItems><height>420</height><page>TeamRaiserProgressWidget</page><showLabel>false</showLabel><showScrollbars>false</showScrollbars><width>100%</width></layoutItems></layoutColumns><style>OneColumn</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>false</detailHeading><editHeading>true</editHeading><label>Information</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Name</field></layoutItems><layoutItems><behavior>Required</behavior><field>Contact__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participation_Type__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participant_s_Home_Page__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Registration_Date__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Opportunity__c</field></layoutItems><layoutItems><behavior>Required</behavior><field>TeamRaiser_Participation_Type__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Required</behavior><field>Campaign__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team_Captain__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Fundraising_Goal__c</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Separator</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Registration_Fee__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Total_Raised__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Required</behavior><field>Extra_Gift__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Upsell_Amount__c</field></layoutItems></layoutColumns><style>TwoColumnsLeftToRight</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>System Information</label><layoutColumns><layoutItems><behavior>Readonly</behavior><field>CreatedById</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Readonly</behavior><field>LastModifiedById</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Custom Links</label><layoutColumns/><layoutColumns/><layoutColumns/><style>CustomLinks</style></layoutSections><relatedLists><fields>OPPORTUNITY.NAME</fields><fields>ACCOUNT.NAME</fields><fields>OPPORTUNITY.CLOSE_DATE</fields><fields>OPPORTUNITY.AMOUNT</fields><relatedList>Opportunity.TeamRaiser_Registration__c</relatedList></relatedLists><relatedLists><fields>NAME</fields><fields>Upsell_Item__c</fields><fields>Item_Price__c</fields><fields>Item_Quantity__c</fields><fields>Total_Amount__c</fields><fields>Date_Fulfilled__c</fields><relatedList>TeamRaiser_Registration_Upsell__c.TeamRaiser_Registration__c</relatedList></relatedLists><showEmailCheckbox>false</showEmailCheckbox><showHighlightsPanel>false</showHighlightsPanel><showInteractionLogPanel>false</showInteractionLogPanel><showRunAssignmentRulesCheckbox>false</showRunAssignmentRulesCheckbox><showSubmitAndAttachButton>false</showSubmitAndAttachButton><summaryLayout><masterLabel>00hE0000001CHzf</masterLabel><sizeX>4</sizeX><sizeY>0</sizeY><summaryLayoutStyle>Default</summaryLayoutStyle></summaryLayout></records></result></readMetadataResponse></soapenv:Body></soapenv:Envelope>
11:38:12.782 (782606961)|CONSTRUCTOR_ENTRY|[4077]|01po0000003Oh7D|<init>()
11:38:12.782 (782737189)|CONSTRUCTOR_EXIT|[4077]|01po0000003Oh7D|<init>()
11:38:12.799 (799474066)|CALLOUT_RESPONSE|[8876]|
11:38:12.799 (799623964)|METHOD_ENTRY|[8889]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
11:38:12.799 (799649892)|METHOD_EXIT|[8889]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
11:38:12.799 (799659149)|METHOD_EXIT|[7]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
11:38:12.799 (799727580)|METHOD_ENTRY|[7]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
11:38:12.799 (799741148)|METHOD_EXIT|[7]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
11:38:12.801 (801307062)|USER_DEBUG|[9]|DEBUG|FullName: TeamRaiser_Registration__c-TeamRaiser Registration Layout
customButtons: null
headers: null
Sections: (LayoutSection: customLabel: true &#124; label: TeamRaiser Progress &#124; detailHeading: true &#124; style: OneColumn &#124; layoutColumns: (LayoutItems: (
LayoutItem: page_x: TeamRaiserProgressWidget scontrol: null field: null)) 
 , LayoutSection: customLabel: false &#124; label: Information &#124; detailHeading: false &#124; style: TwoColumnsTopToBottom &#124; layoutColumns: (LayoutItems: (
LayoutItem: page_x: null scontrol: null field: Name, 
LayoutItem: page_x: null scontrol: null field: Contact__c, 
LayoutItem: page_x: null scontrol: null field: Participation_Type__c, 
LayoutItem: page_x: null scontrol: null field: Participant_s_Home_Page__c, 
LayoutItem: page_x: null scontrol: null field: Registration_Date__c, 
LayoutItem: page_x: null scontrol: null field: Opportunity__c, 
LayoutItem: page_x: null scontrol: null field: TeamRaiser_Participation_Type__c), LayoutItems: (
LayoutItem: page_x: null scontrol: null field: Campaign__c, 
LayoutItem: page_x: null scontrol: null field: Team_Captain__c, 
LayoutItem: page_x: null scontrol: null field: Team__c, 
LayoutItem: page_x: null scontrol: null field: Fundraising_Goal__c)) 
 , LayoutSection: customLabel: true &#124; label: Separator &#124; detailHeading: false &#124; style: TwoColumnsLeftToRight &#124; layoutColumns: (LayoutItems: (
LayoutItem: page_x: null scontrol: null field: Registration_Fee__c, 
LayoutItem: page_x: null scontrol: null field: Total_Raised__c), LayoutItems: (
LayoutItem: page_x: null scontrol: null field: Extra_Gift__c, 
LayoutItem: page_x: null scontrol: null field: Upsell_Amount__c)) 
 , LayoutSection: customLabel: false &#124; label: System Information &#124; detailHeading: true &#124; style: TwoColumnsTopToBottom &#124; layoutColumns: (LayoutItems: (
LayoutItem: page_x: null scontrol: null field: CreatedById), LayoutItems: (
LayoutItem: page_x: null scontrol: null field: LastModifiedById)) 
 , LayoutSection: customLabel: true &#124; label: Custom Links &#124; detailHeading: false &#124; style: CustomLinks &#124; layoutColumns: (LayoutItems: null, LayoutItems: null, LayoutItems: null) 
 )
relatedObjects: null
relatedLists: (RelatedListItem:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), customButtons=null, customButtons_type_info=(customButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), excludeButtons=null, excludeButtons_type_info=(excludeButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), field_order_type_info=(customButtons, excludeButtons, fields, relatedList, sortField, sortOrder), fields=(OPPORTUNITY.NAME, ACCOUNT.NAME, OPPORTUNITY.CLOSE_DATE, OPPORTUNITY.AMOUNT), fields_type_info=(fields, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), relatedList=Opportunity.TeamRaiser_Registration__c, relatedList_type_info=(relatedList, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false), sortField=null, sortField_type_info=(sortField, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false), sortOrder=null, sortOrder_type_info=(sortOrder, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false)], RelatedListItem:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), customButtons=null, customButtons_type_info=(customButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), excludeButtons=null, excludeButtons_type_info=(excludeButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), field_order_type_info=(customButtons, excludeButtons, fields, relatedList, sortField, sortOrder), fields=(NAME, Upsell_Item__c, Item_Price__c, Item_Quantity__c, Total_Amount__c, Date_Fulfilled__c), fields_type_info=(fields, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), relatedList=TeamRaiser_Registration_Upsell__c.TeamRaiser_Registration__c, relatedList_type_info=(relatedList, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false), sortField=null, sortField_type_info=(sortField, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false), sortOrder=null, sortOrder_type_info=(sortOrder, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false)])
miniLayout null

11:38:13.412 (803670020)|CUMULATIVE_LIMIT_USAGE
11:38:13.412|LIMIT_USAGE_FOR_NS|(default)|
  Number of SOQL queries: 0 out of 100
  Number of query rows: 0 out of 50000
  Number of SOSL queries: 0 out of 20
  Number of DML statements: 0 out of 150
  Number of DML rows: 0 out of 10000
  Maximum CPU time: 0 out of 10000
  Maximum heap size: 0 out of 6000000
  Number of callouts: 1 out of 100
  Number of Email Invocations: 0 out of 10
  Number of future calls: 0 out of 50
  Number of queueable jobs added to the queue: 0 out of 50
  Number of Mobile Apex push calls: 0 out of 10

11:38:13.412|CUMULATIVE_LIMIT_USAGE_END

11:38:12.803 (803701541)|CODE_UNIT_FINISHED|execute_anonymous_apex
11:38:12.804 (804938755)|EXECUTION_FINISHED